<a href="https://colab.research.google.com/github/Pranav210905/Pandas-/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

Series

In [ ]:
a=[1,2,4,5,5]
series_data=pd.Series(a)
series_data

0    1
1    2
2    4
3    5
4    5
dtype: int64

In [ ]:
type(series_data)

pandas.core.series.Series

In [ ]:
series_data.values

array([1, 2, 4, 5, 5])

In [ ]:
series_data.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
series_data.dtype

dtype('int64')

In [ ]:
series_data.index=[101,102,103,104,105]

In [ ]:
series_data

101    1
102    2
103    4
104    5
105    5
dtype: int64

In [ ]:
series_data.index

Index([101, 102, 103, 104, 105], dtype='int64')

In [ ]:
series_data[101]

1

In [ ]:
series_data[104]

5

In [ ]:
series_data.iloc[0]

1

In [ ]:
series_data.iloc[[2,4]]

103    4
105    5
dtype: int64

In [ ]:
series_data.loc[[101,104]]

101    1
104    5
dtype: int64

To Add,Update,Delete,Slicing

In [ ]:
series_data[106] = 90
series_data

101     1
102     2
103     4
104     5
105     5
106    90
dtype: int64

In [ ]:
series_data[104]=74
series_data

101     1
102     2
103     4
104    74
105     5
106    90
dtype: int64

In [ ]:
series_data.drop(105,inplace=True)

In [ ]:
series_data

101     1
102     2
103     4
104    74
106    90
dtype: int64

In [ ]:
series_data[:2]

101    1
102    2
dtype: int64

In [ ]:
series_data[::-1]

106    90
104    74
103     4
102     2
101     1
dtype: int64

In [ ]:
series_data[1:5:2]

102     2
104    74
dtype: int64

Creating Series by Dictionary

In [ ]:
data1={
    "AN":40,
    "BM":80,
    "CM":120,
    "DM":160
}
s=pd.Series(data1)
s

AN     40
BM     80
CM    120
DM    160
dtype: int64

In [ ]:
s.index = range(1,5)
s

1     40
2     80
3    120
4    160
dtype: int64

In [ ]:
s.values

array([ 40,  80, 120, 160])

In [ ]:
s.index.name="Short Form"
s

Short Form
1     40
2     80
3    120
4    160
dtype: int64

In [ ]:
s.index

RangeIndex(start=1, stop=5, step=1, name='Short Form')

In [ ]:
result=[10,20,30,40,50]
roll_no=[1,2,3,4,5]
s2=pd.Series(data=result,index=roll_no)
s2.index.name="Roll no"
s2

Roll no
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [ ]:
s2.isnull()

Roll no
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [ ]:
s2.notnull()

Roll no
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [ ]:
s2.isnull().sum()

0

In [ ]:
s2.notnull().sum()

5

In [ ]:
s2.head()

Roll no
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [ ]:
s2.tail(3)

Roll no
3    30
4    40
5    50
dtype: int64

In [ ]:
s2.head(4)

Roll no
1    10
2    20
3    30
4    40
dtype: int64

In [ ]:
s2.tail()

Roll no
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [ ]:
series_data.duplicated()

101    False
102    False
103    False
104    False
106    False
dtype: bool

In [ ]:
series_data[105]=5

In [ ]:
series_data[107]=5
series_data.duplicated()

101    False
102    False
103    False
104    False
106    False
105    False
107     True
dtype: bool

In [ ]:
series_data.duplicated().sum()

1

In [ ]:
series_data.dropna().duplicated()

101    False
102    False
103    False
104    False
106    False
105    False
107     True
dtype: bool

In [ ]:
series_data.drop_duplicates(inplace=True)

In [ ]:
series_data.duplicated()

101    False
102    False
103    False
104    False
106    False
105    False
dtype: bool